{
  "main": {
    "navbar": {
      "brand": {
        "label": "RESEN",
        "logo": {
          "alt": "main logo for website navigation"
        }
      },
      "menu": {
        "home": "Home",
        "about": "About",
        "portfolio": "Portfolio",
        "resources": "Resources",
        "contact": "Contact",
        "github": "GitHub",
        "language": "Language"
      }
    },
    "home": {
      "metadata": {
        "title": "Resen | Full Stack Developer",
        "description": "Welcome to my NextJS website, a showcase of my portfolio and projects brought to life with cutting-edge technology."
      },
      "profile": {
        "picture": {
          "alt": "developer profile picture"
        },
        "name": "RESEN",
        "specialty": {
          "fullStackDeveloper": "FULL STACK DEVELOPER",
          "frontEndDeveloper": "FRONT END DEVELOPER",
          "backEndDeveloper": "BACK END DEVELOPER",
          "middlewareDeveloper": "MIDDLEWARE DEVELOPER",
          "mobileLegendsPlayer": "MOBILE LEGENDS PLAYER",
          "horrorEnthusiast": "HORROR ENTHUSIAST"
        },
        "bio": "Analytical programmer with a strong problem-solving mindset, adept at optimizing code for performance and efficiency.",
        "chatbot": "HELLO",
        "explore": "EXPLORE"
      },
      "explore": {
        "home": "HOME",
        "about": "ABOUT",
        "portfolio": "PORTFOLIO",
        "resources": "RESOURCES",
        "contact": "CONTACT",
        "github": "GITHUB"
      },
      "chatbot": {
        "botName": "{botName} [BOT]",
        "placeholder": {
          "input": "Type a message"
        },
        "error": {
          "offline": "Oops! It appears that you're currently offline. Please ensure that you're connected to the internet and try again later.",
          "empty": "Oops! It looks like you forgot to write a message. Please enter your message before sending it my way.",
          "tooShort": "Oops! Your message must be at least 1 character long. Please enter a message with at least 1 character before sending it.",
          "tooLong": "Oops! Your message exceeds the maximum limit of 160 characters. Please shorten your message and try again.",
          "client": "Oops! It seems there was an issue with your message. Please make sure you've entered a valid message and try again.",
          "server": "Oops! It looks like something went wrong on my end, and I'm unable to provide a response at the moment. I apologize for any inconvenience caused. Please come back later, and I'll be back up and running. Thank you for your patience."
        }
      }
    },
    "about": {
      "metadata": {
        "title": "About | Resen",
        "description": "Meet Resen, a passionate web developer showcasing skills, projects, and experiences in the dynamic field of web development."
      },
      "header": {
        "title": "about",
        "subtitle": "Unveiling the Mind and Vision Behind the Website",
        "description": "Step behind the curtain and delve into the mind of a digital enthusiast, as I divulge the story of my adventures in design and development."
      },
      "author": {
        "title": "MEET RESEN",
        "content": {
          "paragraph1": "Welcome to my personal portfolio website! My name is Resen, and I'm a Full Stack developer based in Jakarta with over {years} years of experience in the field.",
          "paragraph2": "I specialize in both Front End and Back End development, bringing a comprehensive skill set to the table. With a strong focus on creating visually appealing and user-friendly web applications, I utilize technologies such as ReactJS, NextJS, NodeJS, MySQL, and more to deliver exceptional results.",
          "paragraph3": "From crafting captivating user interfaces to implementing robust functionality, I strive to create seamless and efficient websites. My passion for development drives me to continuously refine my skills, ensuring that I deliver high-quality solutions that meet the unique requirements of each project.",
          "paragraph4": "Feel free to explore my portfolio and discover some of the projects I have worked on. If you have any questions, please don't hesitate to reach out. I am always open to connecting with anyone who shares a passion for web development and innovation."
        }
      },
      "experience": {
        "title": "WORK HISTORY",
        "career": {
          "position1": {
            "startDate": "Mar 2017",
            "company": "Bina Nusantara IT Division",
            "title": "Web Developer | Internship",
            "description": "Bina Nusantara IT Division is one of the Bina Nusantara divisions that provide information technology support for other units under the auspices of the Bina Nusantara Foundation. It was here that I began my career as a full stack web developer, where I handled a project called Binusmaya, which is a learning management system application based on the CodeIgniter framework."
          },
          "position2": {
            "startDate": "Feb 2019",
            "company": "Creator of PDF Gear",
            "title": ".NET Developer | Self-Employed",
            "description": "I am a curious individual who enjoys learning new things. It all started from my curiosity, where I learned how to create a simple desktop application using the Windows Presentation Foundation (WPF) framework based on the C# programming language. Gradually implementing features one by one, I didn't realize that in the end, I successfully developed a complex PDF document manipulation application that I named PDF Gear."
          },
          "position3": {
            "startDate": "Nov 2020",
            "company": "PT Bintang Aplikasi Perkasa",
            "title": "Web Developer | Full Time",
            "description": "PT Bintang Aplikasi Perkasa is an IT consulting company specializing in networking. In this start-up company, I worked as a full-stack developer, handling various web projects. My responsibilities included developing new products and managing existing applications, with a majority of them utilizing CodeIgniter, React.js, and Node.js."
          },
          "position4": {
            "startDate": "Jul 2022",
            "company": "PT Bank CIMB Niaga Tbk",
            "title": "Middleware Developer | Full Time",
            "description": "PT Bank CIMB Niaga Tbk is the sixth largest bank in Indonesia based on assets, established in 1955. In my role as a middleware developer in the Enterprise Service Bus (ESB) division, which is relatively new to me, I am responsible for developing APIs used for various application integration purposes using tools such as IBM MQ, IBM App Connect, and others."
          }
        }
      },
      "skill": {
        "title": "SKILL SET",
        "set": "HTML,CSS,Bootstrap,SASS,TailwindCSS,JavaScript,jQuery,ReactJS,NextJS,Redux,NodeJS,ExpressJS,SocketIO,CSharp,DotNet,PHP,CodeIgniter,MySQL,SQLServer,GraphQL,YAML,Postman,Heroku,GitHub,Trello,VSCode"
      },
      "github": {
        "title": "UNDER THE HOOD",
        "content": {
          "paragraph1": "Here, I'll provide you with some insights into the technologies and frameworks that power my personal portfolio website.",
          "paragraph2": "This website is built using Next.js, a powerful React framework for server-side rendering. Next.js enables me to create both static and dynamic pages, resulting in a fast and efficient user experience.",
          "paragraph3": "To style the website, I've utilized Tailwind CSS, a versatile utility-first CSS framework. Tailwind CSS offers a comprehensive set of pre-built components and utility classes, making it easy to create visually appealing and responsive designs.",
          "paragraph4": "For managing the application state, I've integrated Redux. Redux is a reliable state management library that centralizes the data flow in my application. With Redux, I can effectively handle complex data interactions and ensure a smooth user experience.",
          "paragraph5": "On the backend, I've implemented Node.js, a JavaScript runtime environment. Node.js allows me to handle server-side logic and API requests, providing a scalable and efficient foundation for my web application.",
          "paragraph6": "For storing and managing the application's data, I've utilized MySQL, a robust relational database management system. MySQL offers reliability, scalability, and performance, making it an excellent choice for handling structured data in my web application.",
          "paragraph7": "To enable real-time communication between the frontend and backend, I've incorporated Socket.io. Socket.io is a powerful library that facilitates bidirectional and event-based communication. It empowers my website with instant updates and live interactions, enhancing the overall user experience.",
          "paragraph8": "If you're interested in exploring the source code of my website, you can find it on my GitHub repository. Feel free to reach out if you have any questions or want to know more about my work."
        },
        "repository": {
          "label": {
            "frontEnd": "Source code (frontend)",
            "backEnd": "Source code (backend)"
          }
        }
      },
      "linkedin": {
        "title": "GET CONNECTED",
        "description": "Looking to learn more about my professional background? Visit my LinkedIn profile to uncover my extensive experience, industry insights, and professional achievements. Let's connect and forge valuable professional connections.",
        "connect": "Let's connect!"
      }
    },
    "portfolio": {
      "metadata": {
        "title": "Portfolio | Resen",
        "description": "Explore my diverse collection of projects showcasing my creativity, skills, and passion for web development."
      },
      "header": {
        "title": "portfolio",
        "subtitle": "A Showcase of Innovative Projects and Personal Endeavors",
        "description": "Discover a captivating collection of my projects, where innovation meets design. Immerse yourself in an inspiring showcase of creativity and explore the limitless possibilities of my work."
      },
      "showcase": {
        "title": "PROJECTS",
        "project": {
          "breezy": {
            "title": "Breezy",
            "description": "Effortless communication is just a tap away with Breezy. Designed to simplify your conversations, Breezy offers a clean and intuitive platform where you can effortlessly chat with friends and build meaningful connections. Enjoy the freedom of breezy conversations that let you focus on what truly matters."
          },
          "viewProject": "VIEW PROJECT"
        }
      }
    },
    "resources": {
      "metadata": {
        "title": "Resources | Resen",
        "description": "Discover a range of downloadable guides, tutorials, and other enriching resources for your benefit."
      },
      "header": {
        "title": "resources",
        "subtitle": "Your Gateway to Endless Inspiration and Learning",
        "description": "Explore a world of knowledge with my extensive collection of downloadable resources. From guides to tutorials, my carefully curated selection covers various interests and disciplines, empowering your learning journey."
      },
      "development": {
        "content": {
          "paragraph1": "Thank you for visiting the resource page of my personal portfolio website. I'm thrilled to share that the website is currently undergoing development and exciting updates are in progress.",
          "paragraph2": "I'm actively working on bringing you a collection of valuable guides, tutorials, and other resources to enhance your experience. While there are no materials available for download at the moment, rest assured that I am dedicating my efforts to curating a comprehensive library of resources.",
          "paragraph3": "I appreciate your patience and understanding during this development phase. Your support motivates me to deliver the best possible materials for you. Please check back soon as I continue to work diligently on expanding the resource page.",
          "paragraph4": "If you have any specific requests or suggestions for the type of materials you'd like to see, please don't hesitate to reach out. Your feedback is highly valued as it helps me tailor the content to your needs.",
          "paragraph5": "Thank you for your interest, and I look forward to sharing an exceptional collection of resources with you very soon!"
        }
      }
    },
    "contact": {
      "metadata": {
        "title": "Contact | Resen",
        "description": "Interested in my work? Use this contact page to reach out and learn more about my portfolio. I am here to answer your queries."
      },
      "header": {
        "title": "contact",
        "subtitle": "Explore Your Options by Getting in Touch",
        "description": "Have a friendly message to share, feedback to provide, insights to offer, or want to stay updated? Feel free to reach out to me directly, and I'll be happy to provide the answers and support you're looking for."
      },
      "form": {
        "title": "STAY CONNECTED",
        "description": "I'd love to hear from you! Whether you have a question, feedback, or just want to chat, feel free to reach out using the contact form below. Let's stay connected!",
        "placeholder": {
          "name": "Name",
          "email": "Email",
          "message": "Message",
          "honeypot": "Phone"
        },
        "label": {
          "submit": "SUBMIT"
        },
        "error": {
          "offline": "You are currently offline. Please check your internet connection and try again later.",
          "throttle": "You are submitting too quickly. Please take a moment and try again.",
          "input": {
            "name": {
              "empty": "Please enter your name.",
              "tooShort": "Your name is too short. Please enter at least 2 characters.",
              "tooLong": "Your name is too long. Please enter a maximum of 120 characters.",
              "invalid": "Please enter a valid name using only letters and spaces."
            },
            "email": {
              "empty": "Please enter your email address.",
              "tooShort": "Your email is too short. Please enter at least 3 characters.",
              "tooLong": "Your email is too long. Please enter a maximum of 320 characters.",
              "invalid": "Please enter a valid email address."
            },
            "message": {
              "empty": "Please enter a message.",
              "tooShort": "Your message is too short. Please enter at least 15 characters.",
              "tooLong": "Your message is too long. Please enter a maximum of 2000 characters."
            },
            "honeypot": "Bot detection system triggered. Please ensure you are a human and not a bot.",
            "recaptcha": "Apologies, the reCAPTCHA verification is not ready yet. Please wait a moment and try again."
          },
          "client": "There was an error processing your form submission. Please review your information and try again.",
          "server": "Form submission failed due to a server error. We apologize for the inconvenience. Please try again later.",
          "limit": "You have exceeded the maximum number of contact form submissions for today. Please try again tomorrow."
        },
        "success": "Thank you! Your form has been successfully submitted."
      }
    }
  }
}
