{
  "main": {
    "navbar": {
      "brand": {
        "label": "RESEN",
        "logo": {
          "alt": "logo utama untuk navigasi situs web"
        }
      },
      "menu": {
        "home": "Beranda",
        "about": "Tentang",
        "portfolio": "Portofolio",
        "resources": "Bahan",
        "contact": "Kontak",
        "github": "GitHub",
        "language": "Bahasa"
      }
    },
    "home": {
      "metadata": {
        "title": "Resen | Pengembang Full Stack",
        "description": "Selamat datang di situs web NextJS saya, sebuah peragaan portofolio dan proyek-proyek saya yang dihidupkan dengan teknologi mutakhir."
      },
      "profile": {
        "picture": {
          "alt": "foto profil pengembang"
        },
        "name": "RESEN",
        "specialty": {
          "fullStackDeveloper": "PENGEMBANG FULL STACK",
          "frontEndDeveloper": "PENGEMBANG FRONT END",
          "backEndDeveloper": "PENGEMBANG BACK END",
          "middlewareDeveloper": "PENGEMBANG MIDDLEWARE",
          "mobileLegendsPlayer": "PEMAIN MOBILE LEGENDS",
          "horrorEnthusiast": "PENGGEMAR HORROR"
        },
        "bio": "Programmer analitis dengan pola pikir yang kuat dalam memecahkan masalah, terampil dalam mengoptimalkan kode untuk performa dan efisiensi.",
        "chatbot": "HALO",
        "explore": "JELAJAH"
      },
      "explore": {
        "home": "BERANDA",
        "about": "TENTANG",
        "portfolio": "PORTOFOLIO",
        "resources": "BAHAN",
        "contact": "KONTAK",
        "github": "GITHUB"
      },
      "chatbot": {
        "botName": "{botName} [BOT]",
        "placeholder": {
          "input": "Ketikkan pesan"
        },
        "error": {
          "offline": "Ups! Tampaknya Anda sedang offline saat ini. Pastikan Anda terhubung ke internet dan coba lagi nanti.",
          "empty": "Ups! Sepertinya Anda lupa menulis pesan. Silakan masukkan pesan Anda sebelum mengirimkannya kepada saya.",
          "tooShort": "Ups! Pesan Anda harus memiliki minimal 1 karakter. Silakan masukkan pesan dengan minimal 1 karakter sebelum mengirimkannya.",
          "tooLong": "Ups! Pesan Anda melebihi batas maksimum 160 karakter. Mohon mempersingkat pesan Anda dan coba lagi.",
          "client": "Ups! Sepertinya ada masalah dengan pesan Anda. Pastikan Anda telah memasukkan pesan yang valid dan coba lagi.",
          "server": "Ups! Sepertinya ada masalah pada sisi saya, dan saya tidak dapat memberikan respons saat ini. Saya mohon maaf atas segala ketidaknyamanan yang disebabkan. Silakan kembali nanti, dan saya akan kembali berfungsi. Terima kasih atas kesabaran Anda."
        }
      }
    },
    "about": {
      "metadata": {
        "title": "Tentang | Resen",
        "description": "Kenali Resen, seorang pengembang web berbakat yang menampilkan keterampilan, proyek, dan pengalamannya dalam bidang pengembangan web yang dinamis."
      },
      "header": {
        "title": "tentang",
        "subtitle": "Mengupas Pikiran dan Visi di Balik Konsepsi Situs Web",
        "description": "Ikutlah ke belakang layar dan terjunlah ke dalam dunia pikiran seorang penggemar digital, saat saya berbagi kisah petualangan saya dalam desain dan pengembangan."
      },
      "author": {
        "title": "KENALI RESEN",
        "content": {
          "paragraph1": "Selamat datang di situs web portofolio pribadi saya! Nama saya Resen, dan saya adalah seorang pengembang Full Stack yang berbasis di Jakarta dengan pengalaman lebih dari {years} tahun di bidang ini.",
          "paragraph2": "Saya mengkhususkan diri dalam pengembangan Front End dan Back End, membawa beragam keterampilan yang komprehensif. Dengan fokus yang kuat pada pengembangan aplikasi web yang menarik secara visual dan ramah pengguna, saya memanfaatkan teknologi seperti ReactJS, NextJS, NodeJS, MySQL, dan lainnya untuk memberikan hasil yang luar biasa.",
          "paragraph3": "Dari merancang antarmuka pengguna yang menarik hingga mengimplementasikan fungsionalitas yang solid, saya berupaya untuk mengembangkan situs web yang mulus dan efisien. Semangat saya dalam pengembangan mendorong saya untuk terus mengasah keterampilan saya, memastikan bahwa saya memberikan solusi berkualitas tinggi yang memenuhi kebutuhan unik dari setiap proyek.",
          "paragraph4": "Silakan jelajahi portofolio saya dan temukan beberapa proyek yang telah saya kerjakan. Jika Anda memiliki pertanyaan, jangan ragu untuk menghubungi saya. Saya selalu terbuka untuk berhubungan dengan siapa pun yang memiliki minat dalam pengembangan web dan inovasi."
        }
      },
      "experience": {
        "title": "PENGALAMAN KERJA",
        "career": {
          "position1": {
            "startDate": "Mar 2017",
            "company": "Bina Nusantara IT Division",
            "title": "Pengembang Web | Magang",
            "description": "Bina Nusantara IT Division merupakan salah satu divisi Bina Nusantara yang memberikan dukungan teknologi informasi untuk unit-unit lain di bawah naungan Yayasan Bina Nusantara. Di sinilah saya memulai karier sebagai developer web Full Stack, di mana saya menangani proyek bernama Binusmaya, yang merupakan aplikasi sistem manajemen pembelajaran berbasis kerangka kerja CodeIgniter."
          },
          "position2": {
            "startDate": "Feb 2019",
            "company": "Kreator PDF Gear",
            "title": "Developer .NET | Wirausaha",
            "description": "Saya adalah individu yang penuh rasa ingin tahu dan senang belajar hal-hal baru. Semuanya dimulai dari rasa ingin tahu saya, di mana saya belajar bagaimana membuat aplikasi desktop sederhana menggunakan kerangka kerja Windows Presentation Foundation (WPF) yang berbasis bahasa pemrograman C#. Secara bertahap mengimplementasikan fitur satu per satu, saya tidak menyadari bahwa pada akhirnya, saya berhasil mengembangkan aplikasi manipulasi dokumen PDF yang kompleks yang saya beri nama PDF Gear."
          },
          "position3": {
            "startDate": "Nov 2020",
            "company": "PT Bintang Aplikasi Perkasa",
            "title": "Pengembang Web | Penuh Waktu",
            "description": "PT Bintang Aplikasi Perkasa adalah perusahaan konsultan TI yang mengkhususkan diri dalam jaringan komputer. Di perusahaan start-up ini, saya bekerja sebagai pengembang Full Stack, menangani berbagai proyek web. Tanggung jawab saya termasuk mengembangkan produk baru dan mengelola aplikasi yang sudah ada, di mana sebagian besar menggunakan CodeIgniter, React.js, dan Node.js."
          },
          "position4": {
            "startDate": "Jul 2022",
            "company": "PT Bank CIMB Niaga Tbk",
            "title": "Pengembang Middleware | Penuh Waktu",
            "description": "PT Bank CIMB Niaga Tbk adalah bank terbesar keenam di Indonesia berdasarkan aset, didirikan pada tahun 1955. Dalam peran saya sebagai pengembang middleware di divisi Enterprise Service Bus (ESB), yang relatif baru bagi saya, saya bertanggung jawab untuk mengembangkan API yang digunakan untuk berbagai tujuan integrasi aplikasi menggunakan tools seperti IBM MQ, IBM App Connect, dan lainnya."
          }
        }
      },
      "skill": {
        "title": "KEAHLIAN",
        "set": "HTML,CSS,Bootstrap,SASS,TailwindCSS,JavaScript,jQuery,ReactJS,NextJS,Redux,NodeJS,ExpressJS,SocketIO,CSharp,DotNet,PHP,CodeIgniter,MySQL,SQLServer,GraphQL,YAML,Postman,Heroku,GitHub,Trello,VSCode"
      },
      "github": {
        "title": "DI BALIK LAYAR",
        "content": {
          "paragraph1": "Di sini, saya akan memberikan beberapa wawasan tentang teknologi dan kerangka kerja yang saya terapkan untuk mengoperasikan situs web portofolio pribadi saya.",
          "paragraph2": "Website ini dibangun menggunakan Next.js, sebuah kerangka kerja React yang kuat untuk rendering sisi server. Next.js memungkinkan saya untuk membuat halaman-halaman statis dan dinamis, sehingga menghasilkan pengalaman pengguna yang cepat dan efisien.",
          "paragraph3": "Untuk mendesain website ini, saya menggunakan Tailwind CSS, sebuah kerangka kerja CSS utilitas yang serbaguna. Tailwind CSS menawarkan kumpulan komponen yang sudah dibangun sebelumnya dan kelas utilitas yang lengkap, sehingga memudahkan untuk membuat desain yang menarik secara visual dan responsif.",
          "paragraph4": "Untuk mengatur status aplikasi, saya menggunakan Redux. Redux adalah sebuah perpustakaan pengaturan status yang dapat diandalkan yang memusatkan aliran data di aplikasi saya. Dengan Redux, saya bisa mengatasi interaksi data yang rumit dan memastikan pengalaman pengguna yang lancar.",
          "paragraph5": "Di sisi belakang, saya menggunakan Node.js, sebuah lingkungan runtime JavaScript. Node.js memungkinkan saya untuk mengatur logika di sisi server dan permintaan API, memberikan fondasi yang dapat diperluas dan efisien untuk aplikasi web saya.",
          "paragraph6": "Untuk menyimpan dan mengelola data aplikasi, saya menggunakan MySQL, sebuah sistem manajemen basis data relasional yang handal. MySQL menawarkan kehandalan, skalabilitas, dan kinerja yang baik, menjadikannya pilihan yang sangat baik untuk mengelola data terstruktur dalam aplikasi web saya.",
          "paragraph7": "Untuk memungkinkan komunikasi real-time antara bagian depan dan belakang aplikasi, saya menggunakan Socket.io. Socket.io adalah sebuah perpustakaan handal yang memfasilitasi komunikasi dua arah dan berbasis peristiwa. Dengan demikian, situs web saya dapat memperoleh pembaruan instan dan interaksi langsung, meningkatkan pengalaman pengguna secara keseluruhan.",
          "paragraph8": "Jika Anda tertarik untuk menjelajahi kode sumber website saya, Anda dapat menemukannya di repositori GitHub saya. Jangan ragu untuk menghubungi saya jika Anda memiliki pertanyaan atau ingin tahu lebih banyak tentang pekerjaan saya."
        },
        "repository": {
          "label": {
            "frontEnd": "Kode sumber (frontend)",
            "backEnd": "Kode sumber (backend)"
          }
        }
      },
      "linkedin": {
        "title": "TERHUBUNGLAH",
        "description": "Ingin mengetahui lebih banyak tentang latar belakang profesional saya? Kunjungi profil LinkedIn saya untuk melihat pengalaman, wawasan industri, dan pencapaian profesional saya. Ayo terhubung dan bangun hubungan profesional yang berharga bersama-sama.",
        "connect": "Ayo terhubung!"
      }
    },
    "portfolio": {
      "metadata": {
        "title": "Portofolio | Resen",
        "description": "Temukan beragam koleksi proyek saya yang menampilkan kreativitas, keterampilan, dan semangat saya dalam pengembangan web."
      },
      "header": {
        "title": "portofolio",
        "subtitle": "Peragaan Proyek Inovatif dan Upaya Pribadi",
        "description": "Temukan koleksi menarik dari proyek-proyek saya, di mana inovasi bertemu dengan desain. Rasakan pengalaman dalam pameran inspiratif kreativitas dan jelajahi berbagai kemungkinan dari karya-karya saya."
      },
      "showcase": {
        "title": "PROYEK",
        "project": {
          "breezy": {
            "title": "Breezy",
            "description": "Komunikasi yang mudah hanya sejauh satu ketukan dengan Breezy. Dirancang untuk menyederhanakan percakapan Anda, Breezy menawarkan platform yang bersih dan intuitif di mana Anda dapat dengan mudah mengobrol dengan teman dan membangun hubungan yang berarti. Nikmati kebebasan dari percakapan yang santai yang memungkinkan Anda fokus pada hal-hal yang benar-benar penting."
          },
          "viewProject": "LIHAT PROYEK"
        }
      }
    },
    "resources": {
      "metadata": {
        "title": "Bahan | Resen",
        "description": "Temukan berbagai macam panduan, tutorial, dan bahan lain yang bisa diunduh yang mungkin bermanfaat untuk Anda."
      },
      "header": {
        "title": "bahan",
        "subtitle": "Pintu Gerbangmu Menuju Inspirasi dan Pembelajaran Tak Terbatas",
        "description": "Jelajahi dunia pengetahuan dengan koleksi bahan saya yang bisa diunduh. Mulai dari panduan hingga tutorial, koleksi yang saya susun dengan teliti mencakup berbagai minat dan disiplin, membantu kegiatan belajar Anda."
      },
      "development": {
        "content": {
          "paragraph1": "Terima kasih telah mengunjungi halaman bahan situs portofolio pribadi saya. Saya sangat senang sekali memberitahukan bahwa situs web ini sedang dalam proses pengembangan dan ada pembaruan menarik yang sedang dikembangkan.",
          "paragraph2": "Saya aktif mengembangkan kumpulan panduan, tutorial, dan bahan lainnya guna meningkatkan pengalaman Anda. Meskipun belum ada materi yang dapat diunduh saat ini, jangan khawatir karena saya sedang berupaya untuk menyusun bahan yang komprehensif.",
          "paragraph3": "Saya menghargai kesabaran dan pengertian Anda selama fase pengembangan ini. Dukungan Anda memotivasi saya untuk menyediakan bahan sebaik mungkin bagi Anda. Silakan periksa kembali dalam waktu dekat karena saya terus berupaya untuk memperluas halaman bahan ini.",
          "paragraph4": "Jika Anda memiliki permintaan atau saran khusus untuk jenis materi yang ingin Anda lihat, jangan sungkan untuk menghubungi saya. Masukan Anda sangat berharga karena membantu saya menyesuaikan konten dengan kebutuhan Anda.",
          "paragraph5": "Terima kasih atas ketertarikan Anda, dan saya juga tidak sabar untuk segera berbagi koleksi bahan saya yang luar biasa bersama Anda!"
        }
      }
    },
    "contact": {
      "metadata": {
        "title": "Kontak | Resen",
        "description": "Tertarik dengan karya saya? Gunakan halaman kontak ini untuk menghubungi saya dan mempelajari lebih lanjut tentang portofolio saya. Saya di sini untuk menjawab pertanyaan Anda."
      },
      "header": {
        "title": "kontak",
        "subtitle": "Jelajahi Pilihan Anda dengan Menghubungi Saya",
        "description": "Jika Anda ingin membagikan pesan, masukan, atau pandangan, atau ingin tetap terinformasi, jangan ragu untuk menghubungi saya langsung. Saya akan dengan senang hati memberikan jawaban dan dukungan yang Anda butuhkan."
      },
      "form": {
        "title": "TETAP TERHUBUNG",
        "description": "Saya senang mendengar dari Anda! Entah Anda memiliki pertanyaan, masukan, atau hanya ingin ngobrol, jangan ragu untuk menghubungi saya menggunakan formulir kontak di bawah ini. Ayo kita tetap terhubung!",
        "placeholder": {
          "name": "Nama",
          "email": "Email",
          "message": "Pesan",
          "honeypot": "Telepon"
        },
        "label": {
          "submit": "KIRIM"
        },
        "error": {
          "offline": "Anda sedang offline saat ini. Harap periksa koneksi internet Anda dan coba lagi nanti.",
          "throttle": "Anda mengirim terlalu cepat. Harap beri waktu sejenak dan coba lagi.",
          "input": {
            "name": {
              "empty": "Harap masukkan nama Anda.",
              "tooShort": "Nama Anda terlalu singkat. Harap masukkan minimal 2 karakter.",
              "tooLong": "Nama Anda terlalu panjang. Harap masukkan maksimal 120 karakter.",
              "invalid": "Harap masukkan nama yang valid dengan menggunakan huruf dan spasi saja."
            },
            "email": {
              "empty": "Harap masukkan email Anda.",
              "tooShort": "Email Anda terlalu singkat. Harap masukkan minimal 3 karakter.",
              "tooLong": "Email Anda terlalu panjang. Harap masukkan maksimal 320 karakter.",
              "invalid": "Harap masukkan alamat email yang valid."
            },
            "message": {
              "empty": "Harap masukkan pesan.",
              "tooShort": "Pesan Anda terlalu singkat. Harap masukkan minimal 15 karakter.",
              "tooLong": "Pesan Anda terlalu panjang. Harap masukkan maksimal 2000 karakter."
            },
            "honeypot": "Sistem pendeteksian bot teraktivasi. Harap pastikan Anda adalah manusia dan bukan bot.",
            "recaptcha": "Maaf, verifikasi reCAPTCHA belum siap. Silakan tunggu sebentar dan coba lagi."
          },
          "client": "Terjadi kesalahan dalam memproses pengiriman formulir Anda. Silakan periksa kembali informasi yang Anda masukkan dan coba lagi.",
          "server": "Pengiriman formulir gagal karena adanya kesalahan pada server. Kami mohon maaf atas ketidaknyamanannya. Silakan coba lagi nanti.",
          "limit": "Anda telah mencapai batas maksimum pengiriman formulir kontak untuk hari ini. Silakan coba lagi besok."
        },
        "success": "Terima kasih! Formulir Anda telah berhasil dikirim."
      }
    },
    "footer": {
      "author": "RESEN",
      "slogan": "Menyusun Kode dengan Semangat dan Makna"
    }
  },
  "project": {
    "breezy": {
      "login": {
        "metadata": {
          "title": "Breezy | Resen",
          "description": "Masuk ke Breezy dan mulai berbincang dengan teman dan keluarga dengan mudah. Tetap terhubung kapan saja, di mana saja."
        },
        "auth": {
          "welcome": "Selamat Datang di Breezy",
          "title": "Masuk",
          "subtitle": "Akses akun Anda dan mulai chatting.",
          "form": {
            "placeholder": {
              "userName": "Nama Pengguna",
              "password": "Kata Sandi"
            },
            "label": {
              "submit": "Masuk"
            },
            "error": {
              "offline": "Anda sedang offline saat ini. Harap periksa koneksi internet Anda dan coba lagi nanti.",
              "throttle": "Anda mengirim terlalu cepat. Harap beri waktu sejenak dan coba lagi.",
              "input": {
                "userName": {
                  "empty": "Harap masukkan nama pengguna Anda.",
                  "tooShort": "Nama pengguna Anda terlalu singkat. Harap masukkan setidaknya 2 karakter.",
                  "tooLong": "Nama pengguna Anda terlalu panjang. Harap masukkan maksimal 15 karakter.",
                  "invalid": "Harap masukkan nama pengguna yang hanya terdiri dari huruf, angka, tanda hubung, dan garis bawah."
                },
                "password": {
                  "empty": "Harap masukkan kata sandi Anda.",
                  "tooShort": "Kata sandi Anda terlalu singkat. Harap masukkan minimal 8 karakter.",
                  "tooLong": "Kata sandi Anda terlalu panjang. Harap masukkan maksimal 64 karakter."
                },
                "honeypot": "Sistem pendeteksian bot teraktivasi. Harap pastikan Anda adalah manusia dan bukan bot.",
                "recaptcha": "Harap lengkapi verifikasi reCAPTCHA."
              },
              "client": "Ada kesalahan pada proses login Anda. Silakan periksa informasi Anda dan coba lagi.",
              "server": "Maaf, terjadi kesalahan yang tidak terduga saat proses login. Harap coba masuk lagi nanti.",
              "invalid": "Nama pengguna atau kata sandi tidak valid."
            },
            "signup": {
              "description": "Belum memiliki akun?",
              "label": "Daftar di sini!"
            }
          }
        }
      }
    }
  }
}
