{
  "main": {
    "navbar": {
      "brand": {
        "label": "RESEN",
        "logo": {
          "alt": "logo web"
        }
      },
      "menu": {
        "home": "Beranda",
        "about": "Tentang",
        "portfolio": "Portofolio",
        "resources": "Konten",
        "contact": "Kontak",
        "github": "GitHub",
        "language": "Bahasa"
      }
    },
    "home": {
      "metadata": {
        "title": "Resen | Full Stack Developer",
        "description": "Selamat datang di situs web NextJS saya, sebuah showcase dari portofolio dan proyek-proyek saya yang dihidupkan dengan teknologi mutakhir."
      },
      "profile": {
        "picture": {
          "alt": "foto profil penulis"
        },
        "name": "RESEN",
        "specialty": {
          "fullStackDeveloper": "DEVELOPER FULL STACK",
          "frontEndDeveloper": "DEVELOPER FRONT END",
          "backEndDeveloper": "DEVELOPER BACK END",
          "middlewareDeveloper": "DEVELOPER MIDDLEWARE",
          "mobileLegendsPlayer": "PEMAIN MOBILE LEGENDS",
          "horrorEnthusiast": "PENGGEMAR HORROR"
        },
        "bio": "Programmer analitis dengan pola pikir pemecahan masalah yang kuat, terampil dalam meningkatkan kode untuk kinerja dan efisiensi yang optimal.",
        "chatbot": "HALO",
        "explore": "JELAJAH"
      },
      "explore": {
        "home": "BERANDA",
        "about": "TENTANG",
        "portfolio": "PORTOFOLIO",
        "resources": "KONTEN",
        "contact": "KONTAK",
        "github": "GITHUB"
      },
      "chatbot": {
        "botName": "{botName} [BOT]",
        "input": {
          "placeholder": "Ketikkan pesan"
        },
        "error": {
          "offline": "Ups! Tampaknya Anda sedang tidak terhubung ke internet. Mohon pastikan bahwa Anda terhubung ke internet dan coba lagi nanti.",
          "empty": "Ups! Sepertinya Anda lupa menulis pesan. Mohon masukkan pesan Anda sebelum mengirimkannya kepada saya.",
          "tooShort": "Ups! Pesan Anda harus memiliki setidaknya 1 karakter. Mohon masukkan pesan dengan setidaknya 1 karakter sebelum mengirimkannya.",
          "tooLong": "Ups! Pesan Anda melewati batas maksimum 160 karakter. Mohon perpendek pesan Anda dan coba lagi.",
          "client": "Ups! Sepertinya ada masalah dengan pesan Anda. Mohon pastikan Anda telah memasukkan pesan yang valid dan coba lagi.",
          "server": "Ups! Sepertinya ada yang bermasalah di sisi saya dan saya tidak bisa memberikan respons pada saat ini. Saya mohon maaf atas segala ketidaknyamanan yang terjadi. Mohon kembali lagi nanti, dan saya akan kembali beroperasi. Terima kasih atas kesabarannya."
        }
      }
    },
    "about": {
      "metadata": {
        "title": "About | Resen",
        "description": "Temui Resen, pengembang web yang bersemangat, menampilkan keterampilan, proyek, dan pengalaman menarik dalam industri yang dinamis dari web development."
      }
    }
  }
}
